/*--------------------------------------------------------
    랜덤한 정수 값 구하기
    예) getRandom(7) => 0~6사이의 정수 반환
       getRandom(100) => 0~99사이의 정수 반환
*--------------------------------------------------------- */
function getRandom(max){
    return parseInt(Math.random()*(max+1)); //0~1사이 난수
}

/*--------------------------------------------------------
    범위를 지정한 랜덤
    예) getRandomByRange(5,8)
*--------------------------------------------------------- */
function getRandomByRange(min, max){
    return min + (parseInt(Math.random()*(max-min+1)));
}